CREATE USER mysqltest_1@'127.0.0.1/255.255.255.255';
GRANT ALL ON test.* TO mysqltest_1@'127.0.0.1/255.255.255.255';
SHOW GRANTS FOR mysqltest_1@'127.0.0.1/255.255.255.255';
Grants for mysqltest_1@127.0.0.1/255.255.255.255
GRANT USAGE ON *.* TO `mysqltest_1`@`127.0.0.1/255.255.255.255`
GRANT ALL PRIVILEGES ON `test`.* TO `mysqltest_1`@`127.0.0.1/255.255.255.255`
REVOKE ALL ON test.* FROM mysqltest_1@'127.0.0.1/255.255.255.255';
DROP USER mysqltest_1@'127.0.0.1/255.255.255.255';
SELECT USER();
USER()
#
SHOW PROCESSLIST;
#
# Bug #37168: Missing variable - skip_name_resolve
#
SHOW VARIABLES LIKE 'skip_name_resolve';
Variable_name	Value
skip_name_resolve	ON
SHOW GLOBAL VARIABLES LIKE 'skip_name_resolve';
Variable_name	Value
skip_name_resolve	ON
SHOW SESSION VARIABLES LIKE 'skip_name_resolve';
Variable_name	Value
skip_name_resolve	ON
SELECT @@skip_name_resolve;
@@skip_name_resolve
1
SELECT @@LOCAL.skip_name_resolve;
ERROR HY000: Variable 'skip_name_resolve' is a GLOBAL variable
SELECT @@GLOBAL.skip_name_resolve;
@@GLOBAL.skip_name_resolve
1
SET @@skip_name_resolve=0;
ERROR HY000: Variable 'skip_name_resolve' is a read only variable
SET @@LOCAL.skip_name_resolve=0;
ERROR HY000: Variable 'skip_name_resolve' is a read only variable
SET @@GLOBAL.skip_name_resolve=0;
ERROR HY000: Variable 'skip_name_resolve' is a read only variable
End of 5.1 tests
#
# Bug #20438524: 5.7.5 SKIP_NAME_RESOLVE STOPS ALL CONNECTION ATTEMPTS
#
CREATE USER b20438524@'%' IDENTIFIED BY 'pwd';
# set some valid addresses
UPDATE mysql.user SET host='localhost' WHERE user='b20438524';
FLUSH PRIVILEGES;
# cleanup
DELETE FROM mysql.user WHERE user='b20438524';
FLUSH PRIVILEGES;
# must find the pattern
Pattern "'user' entry 'b20438524@localhost' ignored in --skip-name-resolve mode" found
End of 5.7 tests
