---- Init ----
set @my_slave_net_timeout         =@@global.slave_net_timeout;
---- Test ----
set global slave_net_timeout=100;
set global sql_slave_skip_counter=100;
show variables like 'slave_compressed_protocol';
Variable_name	Value
slave_compressed_protocol	OFF
show variables like 'slave_load_tmpdir';
Variable_name	Value
slave_load_tmpdir	SLAVE_LOAD_TMPDIR
show variables like 'slave_skip_errors';
Variable_name	Value
slave_skip_errors	0,3,100,137,643,1752
---- Clean Up ----
set global slave_net_timeout=default;
set global sql_slave_skip_counter= 0;
set @@global.slave_net_timeout= @my_slave_net_timeout;

#
SHOW VARIABLES like 'log_slave_updates';
Variable_name	Value
log_slave_updates	OFF
SELECT @@session.log_slave_updates;
ERROR HY000: Variable 'log_slave_updates' is a GLOBAL variable
SELECT @@global.log_slave_updates;
@@global.log_slave_updates
0
SET @@session.log_slave_updates= true;
ERROR HY000: Variable 'log_slave_updates' is a read only variable
SET @@global.log_slave_updates= true;
ERROR HY000: Variable 'log_slave_updates' is a read only variable
#
SHOW VARIABLES like 'relay_log';
Variable_name	Value
relay_log	
SELECT @@session.relay_log;
ERROR HY000: Variable 'relay_log' is a GLOBAL variable
SELECT @@global.relay_log;
@@global.relay_log
NULL
SET @@session.relay_log= 'x';
ERROR HY000: Variable 'relay_log' is a read only variable
SET @@global.relay_log= 'x';
ERROR HY000: Variable 'relay_log' is a read only variable
#
SHOW VARIABLES like 'relay_log_basename';
Variable_name	Value
relay_log_basename	MYSQLTEST_VARDIR/mysqld.1/data/hostname-relay-bin
SELECT @@session.relay_log_basename;
ERROR HY000: Variable 'relay_log_basename' is a GLOBAL variable
SELECT @@global.relay_log_basename;
@@global.relay_log_basename
MYSQLTEST_VARDIR/mysqld.1/data/hostname-relay-bin
SET @@session.relay_log_basename= 'x';
ERROR HY000: Variable 'relay_log_basename' is a read only variable
SET @@global.relay_log_basename= 'x';
ERROR HY000: Variable 'relay_log_basename' is a read only variable
#
SHOW VARIABLES like 'log_bin_basename';
Variable_name	Value
log_bin_basename	
SELECT @@session.log_bin_basename;
ERROR HY000: Variable 'log_bin_basename' is a GLOBAL variable
SELECT @@global.log_bin_basename;
@@global.log_bin_basename
NULL
SET @@session.log_bin_basename= 'x';
ERROR HY000: Variable 'log_bin_basename' is a read only variable
SET @@global.log_bin_basename= 'x';
ERROR HY000: Variable 'log_bin_basename' is a read only variable
#
SHOW VARIABLES like 'relay_log_index';
Variable_name	Value
relay_log_index	MYSQLTEST_VARDIR/mysqld.1/data/hostname-relay-bin.index
SELECT @@session.relay_log_index;
ERROR HY000: Variable 'relay_log_index' is a GLOBAL variable
SELECT @@global.relay_log_index;
@@global.relay_log_index
MYSQLTEST_VARDIR/mysqld.1/data/hostname-relay-bin.index
SET @@session.relay_log_index= 'x';
ERROR HY000: Variable 'relay_log_index' is a read only variable
SET @@global.relay_log_index= 'x';
ERROR HY000: Variable 'relay_log_index' is a read only variable
#
SHOW VARIABLES like 'log_bin_index';
Variable_name	Value
log_bin_index	
SELECT @@session.log_bin_index;
ERROR HY000: Variable 'log_bin_index' is a GLOBAL variable
SELECT @@global.log_bin_index;
@@global.log_bin_index
NULL
SET @@session.log_bin_index= 'x';
ERROR HY000: Variable 'log_bin_index' is a read only variable
SET @@global.log_bin_index= 'x';
ERROR HY000: Variable 'log_bin_index' is a read only variable
#
SHOW VARIABLES like 'relay_log_info_file';
Variable_name	Value
relay_log_info_file	relay-log.info
SELECT @@session.relay_log_info_file;
ERROR HY000: Variable 'relay_log_info_file' is a GLOBAL variable
SELECT @@global.relay_log_info_file;
@@global.relay_log_info_file
relay-log.info
SET @@session.relay_log_info_file= 'x';
ERROR HY000: Variable 'relay_log_info_file' is a read only variable
SET @@global.relay_log_info_file= 'x';
ERROR HY000: Variable 'relay_log_info_file' is a read only variable
#
SHOW VARIABLES like 'relay_log_space_limit';
Variable_name	Value
relay_log_space_limit	0
SELECT @@session.relay_log_space_limit;
ERROR HY000: Variable 'relay_log_space_limit' is a GLOBAL variable
SELECT @@global.relay_log_space_limit;
@@global.relay_log_space_limit
0
SET @@session.relay_log_space_limit= 7;
ERROR HY000: Variable 'relay_log_space_limit' is a read only variable
SET @@global.relay_log_space_limit= 7;
ERROR HY000: Variable 'relay_log_space_limit' is a read only variable
#
SHOW VARIABLES like 'slave_load_tmpdir';
Variable_name	Value
slave_load_tmpdir	#
SELECT @@session.slave_load_tmpdir;
ERROR HY000: Variable 'slave_load_tmpdir' is a GLOBAL variable
SELECT @@global.slave_load_tmpdir;
@@global.slave_load_tmpdir
#
SET @@session.slave_load_tmpdir= 'x';
ERROR HY000: Variable 'slave_load_tmpdir' is a read only variable
SET @@global.slave_load_tmpdir= 'x';
ERROR HY000: Variable 'slave_load_tmpdir' is a read only variable
#
SHOW VARIABLES like 'slave_skip_errors';
Variable_name	Value
slave_skip_errors	0,3,100,137,643,1752
SELECT @@session.slave_skip_errors;
ERROR HY000: Variable 'slave_skip_errors' is a GLOBAL variable
SELECT @@global.slave_skip_errors;
@@global.slave_skip_errors
0,3,100,137,643,1752
SET @@session.slave_skip_errors= 7;
ERROR HY000: Variable 'slave_skip_errors' is a read only variable
SET @@global.slave_skip_errors= 7;
ERROR HY000: Variable 'slave_skip_errors' is a read only variable
#
# Bug #11766769 : 59959: SMALL VALUES OF --MAX-ALLOWED-PACKET 
#   ARE NOT BEING HONORED
#
CREATE TABLE t1 (a MEDIUMTEXT);
SET GLOBAL max_allowed_packet=2048;
Warnings:
Warning	1708	The value of 'max_allowed_packet' should be no less than the value of 'net_buffer_length'
SET GLOBAL net_buffer_length=4096;
Warnings:
Warning	1708	The value of 'max_allowed_packet' should be no less than the value of 'net_buffer_length'
SHOW SESSION VARIABLES LIKE 'max_allowed_packet';
Variable_name	Value
max_allowed_packet	2048
SHOW SESSION VARIABLES LIKE 'net_buffer_length';
Variable_name	Value
net_buffer_length	4096
Got one of the listed errors
SELECT LENGTH(a) FROM t1;
LENGTH(a)
SET GLOBAL max_allowed_packet=default;
SET GLOBAL net_buffer_length=default;
DROP TABLE t1;
End of 5.1 tests
