SET @start_value = @@global.local_infile;
SELECT @start_value;
@start_value
1
'#--------------------FN_DYNVARS_018_01------------------------#'
SET @@global.local_infile = 0;
SET @@global.local_infile = DEFAULT;
SELECT @@global.local_infile;
@@global.local_infile
1
'#---------------------FN_DYNVARS_018_02-------------------------#'
SET @@global.local_infile = DEFAULT;
SELECT @@global.local_infile = 1;
@@global.local_infile = 1
1
'#--------------------FN_DYNVARS_018_03------------------------#'
SET @@global.local_infile = 0;
SELECT @@global.local_infile;
@@global.local_infile
0
SET @@global.local_infile = 1;
SELECT @@global.local_infile;
@@global.local_infile
1
'#--------------------FN_DYNVARS_018_04-------------------------#'
SET @@global.local_infile = -1;
ERROR 42000: Variable 'local_infile' can't be set to the value of '-1'
SET @@global.local_infile = 2;
ERROR 42000: Variable 'local_infile' can't be set to the value of '2'
SET @@global.local_infile = 100;
ERROR 42000: Variable 'local_infile' can't be set to the value of '100'
SET @@global.local_infile = TRUEF;
ERROR 42000: Variable 'local_infile' can't be set to the value of 'TRUEF'
SET @@global.local_infile = TRUE_F;
ERROR 42000: Variable 'local_infile' can't be set to the value of 'TRUE_F'
SET @@global.local_infile = FALSE0;
ERROR 42000: Variable 'local_infile' can't be set to the value of 'FALSE0'
SET @@global.local_infile = OON;
ERROR 42000: Variable 'local_infile' can't be set to the value of 'OON'
SET @@global.local_infile = ONN;
ERROR 42000: Variable 'local_infile' can't be set to the value of 'ONN'
SET @@global.local_infile = OOFF;
ERROR 42000: Variable 'local_infile' can't be set to the value of 'OOFF'
SET @@global.local_infile = 0FF;
ERROR 42000: Variable 'local_infile' can't be set to the value of '0FF'
SET @@global.local_infile = ' ';
ERROR 42000: Variable 'local_infile' can't be set to the value of ' '
SET @@global.local_infile = " ";
ERROR 42000: Variable 'local_infile' can't be set to the value of ' '
'#-------------------FN_DYNVARS_018_05----------------------------#'
SET @@session.local_infile = 1;
ERROR HY000: Variable 'local_infile' is a GLOBAL variable and should be set with SET GLOBAL
SELECT @@session.local_infile = 1;
ERROR HY000: Variable 'local_infile' is a GLOBAL variable
'#----------------------FN_DYNVARS_018_06------------------------#'
SELECT IF(@@global.local_infile, "ON", "OFF") = VARIABLE_VALUE 
FROM INFORMATION_SCHEMA.GLOBAL_VARIABLES 
WHERE VARIABLE_NAME='local_infile';
IF(@@global.local_infile, "ON", "OFF") = VARIABLE_VALUE
1
'#---------------------FN_DYNVARS_018_07----------------------#'
SET @@global.local_infile = OFF;
SELECT @@global.local_infile;
@@global.local_infile
0
SET @@global.local_infile = ON;
SELECT @@global.local_infile;
@@global.local_infile
1
'#---------------------FN_DYNVARS_018_08----------------------#'
SET @@global.local_infile = TRUE;
SELECT @@global.local_infile;
@@global.local_infile
1
SET @@global.local_infile = FALSE;
SELECT @@global.local_infile;
@@global.local_infile
0
'#---------------------FN_DYNVARS_018_09----------------------#'
SET @@global.local_infile = 1;
SELECT @@local_infile = @@global.local_infile;
@@local_infile = @@global.local_infile
1
'#---------------------FN_DYNVARS_018_10----------------------#'
SET local_infile = 1;
ERROR HY000: Variable 'local_infile' is a GLOBAL variable and should be set with SET GLOBAL
SELECT @@local_infile;
@@local_infile
1
SET global.local_infile = 1;
ERROR 42000: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'global.local_infile = 1' at line 1
SELECT global.local_infile;
ERROR 42S02: Unknown table 'global' in field list
SELECT local_infile = @@session.local_infile;
ERROR 42S22: Unknown column 'local_infile' in 'field list'
SET @@global.local_infile = @start_value;
SELECT @@global.local_infile;
@@global.local_infile
1
