#
# Variable name : offline_mode
# Scope         : Global
#
# Global - default
SELECT @@global.offline_mode;
@@global.offline_mode
0
SELECT @@session.offline_mode;
ERROR HY000: Variable 'offline_mode' is a GLOBAL variable

SET @@global.offline_mode= 'true';
ERROR 42000: Variable 'offline_mode' can't be set to the value of 'true'

SET @@global.offline_mode= 100;
ERROR 42000: Variable 'offline_mode' can't be set to the value of '100'

SET @@global.offline_mode= WRONGVALUE;
ERROR 42000: Variable 'offline_mode' can't be set to the value of 'WRONGVALUE'

# via performance_schema.global_variables
SELECT * FROM performance_schema.global_variables WHERE VARIABLE_NAME LIKE 'offline_mode';
VARIABLE_NAME	VARIABLE_VALUE
offline_mode	OFF
SET @global_saved_tmp =  @@global.offline_mode;

# Altering global variable's value
SET @@global.offline_mode = 0;
SELECT @@global.offline_mode;
@@global.offline_mode
0
SET @@global.offline_mode = TrUe;
SELECT @@global.offline_mode;
@@global.offline_mode
1
SET @@global.offline_mode = FaLsE;
SELECT @@global.offline_mode;
@@global.offline_mode
0

# Variables' values in a new session.
# Global - expect 0
SELECT @@global.offline_mode;
@@global.offline_mode
0

# Switching to the default connection.
SELECT @@global.offline_mode;
@@global.offline_mode
0

# Test if DEFAULT is working as expected.
SET @@global.offline_mode = DEFAULT;

# Global - expect 0
SELECT @@global.offline_mode;
@@global.offline_mode
0

# Restoring the original values.
SET @@global.offline_mode = @global_saved_tmp;
# End of tests.
