SET @global_start_value = @@global.performance_schema_max_digest_sample_age;
SELECT @global_start_value;
@global_start_value
60
#
# Default value
#
SET @@global.performance_schema_max_digest_sample_age = 1;
SET @@global.performance_schema_max_digest_sample_age = DEFAULT;
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
60

# Check if performance_schema_max_digest_sample_age can be accessed with and without @@

SET performance_schema_max_digest_sample_age = 1;
ERROR HY000: Variable 'performance_schema_max_digest_sample_age' is a GLOBAL variable and should be set with SET GLOBAL
SELECT @@performance_schema_max_digest_sample_age;
@@performance_schema_max_digest_sample_age
60
SELECT local.performance_schema_max_digest_sample_age;
ERROR 42S02: Unknown table 'local' in field list
SET global performance_schema_max_digest_sample_age = 1;
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
1

# Change the value of performance_schema_max_digest_sample_age to a valid value

SET @@global.performance_schema_max_digest_sample_age = 1;
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
1
SET @@global.performance_schema_max_digest_sample_age = 5000;
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
5000
SET @@global.performance_schema_max_digest_sample_age = 1048576;
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
1048576

# Change the value of performance_schema_max_digest_sample_age to invalid value

SET @@global.performance_schema_max_digest_sample_age = 0;
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
0
SET @@global.performance_schema_max_digest_sample_age = "T";
ERROR 42000: Incorrect argument type to variable 'performance_schema_max_digest_sample_age'
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
0
SET @@global.performance_schema_max_digest_sample_age = 'Y';
ERROR 42000: Incorrect argument type to variable 'performance_schema_max_digest_sample_age'
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
0
SET @@global.performance_schema_max_digest_sample_age = ' ';
ERROR 42000: Incorrect argument type to variable 'performance_schema_max_digest_sample_age'
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
0
SET @@global.performance_schema_max_digest_sample_age = " ";
ERROR 42000: Incorrect argument type to variable 'performance_schema_max_digest_sample_age'
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
0
SET @@global.performance_schema_max_digest_sample_age = 1.1;
ERROR 42000: Incorrect argument type to variable 'performance_schema_max_digest_sample_age'
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
0
SET @@global.performance_schema_max_digest_sample_age = 1048577;
Warnings:
Warning	1292	Truncated incorrect performance_schema_max_digest_sa value: '1048577'
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
1048576

# Check if the value in GLOBAL Table matches value in variable

SELECT @@global.performance_schema_max_digest_sample_age =
VARIABLE_VALUE FROM performance_schema.global_variables
WHERE VARIABLE_NAME='performance_schema_max_digest_sample_age';
@@global.performance_schema_max_digest_sample_age =
VARIABLE_VALUE
1
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
1048576
SELECT VARIABLE_VALUE FROM performance_schema.global_variables
WHERE VARIABLE_NAME='performance_schema_max_digest_sample_age';
VARIABLE_VALUE
1048576

# Check if ON and OFF values can be used on variable

SET @@global.performance_schema_max_digest_sample_age = OFF;
ERROR 42000: Incorrect argument type to variable 'performance_schema_max_digest_sample_age'
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
1048576
SET @@global.performance_schema_max_digest_sample_age = ON;
ERROR 42000: Incorrect argument type to variable 'performance_schema_max_digest_sample_age'
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
1048576

# Check if TRUE and FALSE values can be used on variable

SET @@global.performance_schema_max_digest_sample_age = TRUE;
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
1
SET @@global.performance_schema_max_digest_sample_age = FALSE;
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
0

# Restore initial value

SET @@global.performance_schema_max_digest_sample_age = @global_start_value;
SELECT @@global.performance_schema_max_digest_sample_age;
@@global.performance_schema_max_digest_sample_age
60
