SET @global_start_value = @@global.slave_allow_batching;
SELECT @global_start_value;
@global_start_value
0
'#--------------------FN_DYNVARS_145_01------------------------#'
SET @@global.slave_allow_batching = 1;
SET @@global.slave_allow_batching = DEFAULT;
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
0
'#---------------------FN_DYNVARS_145_02-------------------------#'
SET slave_allow_batching = 1;
ERROR HY000: Variable 'slave_allow_batching' is a GLOBAL variable and should be set with SET GLOBAL
SELECT @@slave_allow_batching;
@@slave_allow_batching
0
SELECT global.slave_allow_batching;
ERROR 42S02: Unknown table 'global' in field list
SET global slave_allow_batching = 1;
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
'#--------------------FN_DYNVARS_145_03------------------------#'
SET @@global.slave_allow_batching = 0;
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
0
SET @@global.slave_allow_batching = 1;
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
'#--------------------FN_DYNVARS_145_04-------------------------#'
SET @@global.slave_allow_batching = 65538;
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of '65538'
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = ' ';
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of ' '
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = -1;
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of '-1'
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = 2;
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of '2'
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = '1024.01';
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of '1024.01'
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = "T";
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of 'T'
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = "Y";
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of 'Y'
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = YES;
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of 'YES'
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = ONN;
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of 'ONN'
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = OOF;
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of 'OOF'
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = 0FF;
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of '0FF'
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = ' 1';
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of ' 1'
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = NO;
ERROR 42000: Variable 'slave_allow_batching' can't be set to the value of 'NO'
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
'#-------------------FN_DYNVARS_145_05----------------------------#'
SET @@session.slave_allow_batching = 0;
ERROR HY000: Variable 'slave_allow_batching' is a GLOBAL variable and should be set with SET GLOBAL
SET @@slave_allow_batching = 0;
ERROR HY000: Variable 'slave_allow_batching' is a GLOBAL variable and should be set with SET GLOBAL
SET @@local.slave_allow_batching = 0;
ERROR HY000: Variable 'slave_allow_batching' is a GLOBAL variable and should be set with SET GLOBAL
SELECT @@session.slave_allow_batching;
ERROR HY000: Variable 'slave_allow_batching' is a GLOBAL variable
SELECT @@local.slave_allow_batching;
ERROR HY000: Variable 'slave_allow_batching' is a GLOBAL variable
'#----------------------FN_DYNVARS_145_06------------------------#'
SELECT count(VARIABLE_VALUE)
FROM performance_schema.session_variables
WHERE VARIABLE_NAME='slave_allow_batching';
count(VARIABLE_VALUE)
1
'#----------------------FN_DYNVARS_145_07------------------------#'
SELECT VARIABLE_VALUE
FROM performance_schema.global_variables
WHERE VARIABLE_NAME='slave_allow_batching'
into @tmp;
SELECT @@global.slave_allow_batching = @tmp;
@@global.slave_allow_batching = @tmp
0
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SELECT VARIABLE_VALUE
FROM performance_schema.global_variables
WHERE VARIABLE_NAME='slave_allow_batching';
VARIABLE_VALUE
ON
'#---------------------FN_DYNVARS_145_08-------------------------#'
SET @@global.slave_allow_batching = OFF;
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
0
SET @@global.slave_allow_batching = ON;
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
'#---------------------FN_DYNVARS_145_09----------------------#'
SET @@global.slave_allow_batching = TRUE;
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
1
SET @@global.slave_allow_batching = FALSE;
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
0
SET @@global.slave_allow_batching = @global_start_value;
SELECT @@global.slave_allow_batching;
@@global.slave_allow_batching
0
