include/group_replication.inc
Warnings:
Note	####	Sending passwords in plain text without SSL/TLS is extremely insecure.
Note	####	Storing MySQL user name or password information in the connection metadata repository is not secure and is therefore not recommended. Please consider using the USER and PASSWORD connection options for START REPLICA; see the 'START REPLICA Syntax' in the MySQL Manual for more information.
[connection server1]
[connection server1]
SET GLOBAL group_replication_group_name="00000000-1111-2222-3333-444444444444";
SET GLOBAL group_replication_ip_allowlist=NULL;
ERROR 42000: Variable 'group_replication_ip_allowlist' can't be set to the value of 'NULL'
SET GLOBAL group_replication_ip_allowlist="192.256.1.20";
START GROUP_REPLICATION;
ERROR HY000: The START GROUP_REPLICATION command failed as there was an error when initializing the group communication layer.
SET GLOBAL group_replication_ip_allowlist="300.168.1.20";
START GROUP_REPLICATION;
ERROR HY000: The START GROUP_REPLICATION command failed as there was an error when initializing the group communication layer.
SET GLOBAL group_replication_ip_allowlist="192.168.1.0/33";
START GROUP_REPLICATION;
ERROR HY000: The START GROUP_REPLICATION command failed as there was an error when initializing the group communication layer.
SET GLOBAL group_replication_ip_allowlist="192.168.266.0/24";
START GROUP_REPLICATION;
ERROR HY000: The START GROUP_REPLICATION command failed as there was an error when initializing the group communication layer.
SET GLOBAL group_replication_ip_allowlist="8.9.10.0/20,192.168.1.1,192.168.2.0/44";
START GROUP_REPLICATION;
ERROR HY000: The START GROUP_REPLICATION command failed as there was an error when initializing the group communication layer.
SET GLOBAL group_replication_ip_allowlist="8.9.10.0/20,192.168.1.1,AUTOMATIC";
ERROR HY000: The group_replication_ip_allowlist is invalid. Make sure that when specifying "AUTOMATIC" the list contains no other values.
SET GLOBAL group_replication_ip_allowlist="192.168.1.1";
include/start_and_bootstrap_group_replication.inc
include/assert.inc [Assert value changed to 192.168.1.1]
include/stop_group_replication.inc
include/assert_grep.inc [ip_allowlist was successfully logged to the error log]
SET GLOBAL group_replication_ip_allowlist="192.168.1.0/24";
include/start_and_bootstrap_group_replication.inc
include/assert.inc [Assert value changed to 192.168.1.0/24]
include/stop_group_replication.inc
include/assert_grep.inc [ip_allowlist was successfully logged to the error log]
SET GLOBAL group_replication_ip_allowlist="8.9.10.0/20";
include/start_and_bootstrap_group_replication.inc
include/assert.inc [Assert value changed to 8.9.10.0/20]
include/stop_group_replication.inc
include/assert_grep.inc [ip_allowlist was successfully logged to the error log]
SET GLOBAL group_replication_ip_allowlist="fe80::f6dd:5a39:661b:b00b/64,8.9.10.0/20,192.168.1.1,192.168.2.0/24";
include/start_and_bootstrap_group_replication.inc
include/assert.inc [Assert value changed to fe80::f6dd:5a39:661b:b00b/64,8.9.10.0/20,192.168.1.1,192.168.2.0/24]
include/stop_group_replication.inc
include/assert_grep.inc [ip_allowlist was successfully logged to the error log]
SET GLOBAL group_replication_ip_allowlist="CORRECT_HOSTNAME";
include/start_and_bootstrap_group_replication.inc
include/assert.inc [Assert value with hostname is not empty]
include/stop_group_replication.inc
SET GLOBAL group_replication_ip_allowlist="";
include/start_and_bootstrap_group_replication.inc
include/assert.inc [Assert value changed to ""]
include/stop_group_replication.inc
include/assert_grep.inc [ip_allowlist was successfully logged to the error log]
SET GLOBAL group_replication_ip_allowlist=DEFAULT;
ERROR 42000: Variable 'group_replication_ip_allowlist' can't be set to the value of 'DEFAULT'
SET GLOBAL group_replication_ip_allowlist=AUTOMATIC;
include/start_and_bootstrap_group_replication.inc
include/assert.inc [Assert value changed to "AUTOMATIC"]
SET GLOBAL group_replication_ip_allowlist="192.168.1.1";
include/assert.inc [Assert value changed to "192.168.1.1"]
SET GLOBAL group_replication_ip_allowlist="192.256.1.20";
ERROR HY000: The group_replication_ip_allowlist is invalid. Make sure that when specifying "AUTOMATIC" the list contains no other values.
include/assert.inc [Assert value has not changed to "192.256.1.20"]
include/stop_group_replication.inc
[connection server1]
SET GLOBAL group_replication_ip_allowlist="";
include/start_and_bootstrap_group_replication.inc
[connection server2]
include/start_group_replication.inc
CREATE TABLE t1 (c1 INT NOT NULL PRIMARY KEY) ENGINE=InnoDB;
INSERT INTO t1 VALUES (1);
[connection server1]
include/rpl/sync.inc
include/diff_tables.inc [server1:test.t1,server2:test.t1]
DROP TABLE t1;
include/rpl/sync.inc
[connection server1]
include/stop_group_replication.inc
SET GLOBAL group_replication_ip_allowlist= AUTOMATIC;
include/start_group_replication.inc
[connection server2]
include/stop_group_replication.inc
SET GLOBAL group_replication_ip_allowlist= AUTOMATIC;
include/start_group_replication.inc
include/group_replication_end.inc
