include/group_replication.inc
Warnings:
Note	####	Sending passwords in plain text without SSL/TLS is extremely insecure.
Note	####	Storing MySQL user name or password information in the master info repository is not secure and is therefore not recommended. Please consider using the USER and PASSWORD connection options for START SLAVE; see the 'START SLAVE Syntax' in the MySQL Manual for more information.
[connection server1]
[connection server2]
SET @group_replication_gtid_assignment_block_size_save= @@GLOBAL.group_replication_gtid_assignment_block_size;
[connection server1]
SET @group_replication_gtid_assignment_block_size_save= @@GLOBAL.group_replication_gtid_assignment_block_size;

############################################################
# 1. Set invalid values to group_replication_gtid_assignment_block_size.
SET GLOBAL group_replication_gtid_assignment_block_size= ON;
ERROR 42000: Incorrect argument type to variable 'group_replication_gtid_assignment_block_size'
SET GLOBAL group_replication_gtid_assignment_block_size= OFF;
ERROR 42000: Incorrect argument type to variable 'group_replication_gtid_assignment_block_size'
SET GLOBAL group_replication_gtid_assignment_block_size= " ";
ERROR 42000: Incorrect argument type to variable 'group_replication_gtid_assignment_block_size'
SET GLOBAL group_replication_gtid_assignment_block_size= "a";
ERROR 42000: Incorrect argument type to variable 'group_replication_gtid_assignment_block_size'
SET GLOBAL group_replication_gtid_assignment_block_size= 1.0;
ERROR 42000: Incorrect argument type to variable 'group_replication_gtid_assignment_block_size'
SET GLOBAL group_replication_gtid_assignment_block_size= 0;
ERROR 42000: The value 0 is not within the range of accepted values for the option gtid_assignment_block_size. The value must be between 1 and 9223372036854775807 inclusive.
SET GLOBAL group_replication_gtid_assignment_block_size= -1;
ERROR 42000: The value -1 is not within the range of accepted values for the option gtid_assignment_block_size. The value must be between 1 and 9223372036854775807 inclusive.
SET GLOBAL group_replication_gtid_assignment_block_size= 9223372036854775808;
ERROR 42000: The value -9223372036854775808 is not within the range of accepted values for the option gtid_assignment_block_size. The value must be between 1 and 9223372036854775807 inclusive.

############################################################
# 2. Set valid values to group_replication_gtid_assignment_block_size.
SET GLOBAL group_replication_gtid_assignment_block_size= 1;
include/assert.inc [group_replication_gtid_assignment_block_size is correct]
SET GLOBAL group_replication_gtid_assignment_block_size= 65535;
include/assert.inc [group_replication_gtid_assignment_block_size is correct]
SET GLOBAL group_replication_gtid_assignment_block_size= 4294967295;
include/assert.inc [group_replication_gtid_assignment_block_size is correct]
SET GLOBAL group_replication_gtid_assignment_block_size= 9223372036854775807;
include/assert.inc [group_replication_gtid_assignment_block_size is correct]

############################################################
# 3. Try set group_replication_gtid_assignment_block_size
#    while Group Replication is running.
#    It will be disallowed.
SET GLOBAL group_replication_gtid_assignment_block_size= 1;
include/assert.inc [group_replication_gtid_assignment_block_size is correct]
include/start_and_bootstrap_group_replication.inc
SET GLOBAL group_replication_gtid_assignment_block_size= 1000;
ERROR HY000: The GTID assignment block size cannot be set while Group Replication is running
include/assert.inc [group_replication_gtid_assignment_block_size is 1]

############################################################
# 4. Try join a group with a different value for
#    group_replication_gtid_assignment_block_size than the
#    group one. It will be disallowed.
[connection server2]
SET GLOBAL group_replication_gtid_assignment_block_size= 2;
START GROUP_REPLICATION;
ERROR HY000: The server is not configured properly to be an active member of the group. Please see more details on error log.
Matching lines are:
DATE_TIME [ERROR] Plugin group_replication reported: 'The member is configured with a group_replication_gtid_assignment_block_size option value '2' different from the group '1'. The member will now exit the group.'
Occurrences of 'The member is configured with a group_replication_gtid_assignment_block_size option value' in the input file: 1

############################################################
# 5. Clean up.
[connection server1]
include/stop_group_replication.inc
SET GLOBAL group_replication_gtid_assignment_block_size= @group_replication_gtid_assignment_block_size_save;
[connection server2]
SET GLOBAL group_replication_gtid_assignment_block_size= @group_replication_gtid_assignment_block_size_save;
include/group_replication_end.inc
