Repository: mysql/mysql-server
Catalog: debian/po/*.po
Languages: es, fr

source: Really proceed with downgrade?
fr: Faut-il vraiment revenir à la version précédente ?

source: A file named /var/lib/mysql/debian-*.flag exists on this system.
fr: Un fichier /var/lib/mysql/debian-*.flag est présent sur ce système.

source: Such a file is an indication that a mariadb-server package with a higher version has been installed previously.
fr: Cela indique qu'une version plus récente du paquet mariadb-server a été précédemment installée.

source: There is no guarantee that the version you're currently installing will be able to use the current databases.
fr: Il n'est pas garanti que cette version puisse en utiliser les données.

source: Important note for NIS/YP users
fr: Note importante pour les utilisateurs NIS/YP

source: Using MariaDB under NIS/YP requires a mysql user account to be added on the local system with:
fr: L'utilisation de MariaDB avec NIS/YP impose l'ajout d'un compte local « mysql » avec la commande :

source: You should also check the permissions and ownership of the /var/lib/mysql directory:
fr: Vous devez également vérifier le propriétaire et les permissions du répertoire /var/lib/mysql :

source: Remove all MariaDB databases?
fr: Faut-il supprimer toutes les bases de données MariaDB ?

source: The /var/lib/mysql directory which contains the MariaDB databases is about to be removed.
fr: Le répertoire /var/lib/mysql qui contient les bases de données de MariaDB va être supprimé.

source: If you're removing the MariaDB package in order to later install a more recent version or if a different mariadb-server package is already using it, the data should be kept.
fr: Si vous prévoyez d'installer une version plus récente de MariaDB ou si un autre paquet mariadb-server les utilise déjà, vous devriez les conserver.

source: Start the MariaDB server on boot?
fr: Faut-il lancer MariaDB au démarrage ?

source: The MariaDB server can be launched automatically at boot time or manually with the '/etc/init.d/mysql start' command.
fr: MariaDB peut être lancé soit au démarrage, soit en entrant la commande « /etc/init.d/mysql start ».

source: New password for the MariaDB "root" user:
fr: Nouveau mot de passe du superutilisateur de MariaDB :

source: While not mandatory, it is highly recommended that you set a password for the MariaDB administrative "root" user.
fr: Il est très fortement recommandé d'établir un mot de passe pour le compte d'administration de MariaDB (« root »).

source: If this field is left blank, the password will not be changed.
fr: Si ce champ est laissé vide, le mot de passe ne sera pas changé.

source: Repeat password for the MariaDB "root" user:
fr: Confirmation du mot de passe du superutilisateur de MariaDB :

source: Unable to set password for the MariaDB "root" user
fr: Impossible de changer le mot de passe de l'utilisateur « root » de MariaDB

source: An error occurred while setting the password for the MariaDB administrative user. This may have happened because the account already has a password, or because of a communication problem with the MariaDB server.
fr: Une erreur s'est produite lors du changement de mot de passe du compte d'administration. Un mot de passe existait peut-être déjà ou il n'a pas été possible de communiquer avec le serveur MariaDB.

source: You should check the account's password after the package installation.
fr: Vous devriez vérifier le mot de passe de ce compte après l'installation du paquet.

source: Password input error
fr: Erreur de saisie du mot de passe

source: The two passwords you entered were not the same. Please try again.
fr: Le mot de passe et sa confirmation ne sont pas identiques. Veuillez recommencer.

source: NDB Cluster seems to be in use
fr: Abandon de la gestion de NDB

source: MySQL-5.1 no longer provides NDB Cluster support. Please migrate to the new mysql-cluster package and remove all lines starting with "ndb" from all config files below /etc/mysql/.
fr: La version 5.1 de MySQL ne gère plus les grappes NDB. Vous devriez utiliser le paquet mysql-cluster et supprimer toutes les lignes commençant par « ndb » des fichiers de configuration situés dans /etc/mysql.

source: Do you really want to downgrade?
es: ¿Desea realmente instalar una versión anterior?

source: WARNING: The file /var/lib/mysql/debian-*.flag exists. This indicates that a mysql-server package with a higher version has been installed before. It can not be guaranteed that this version can use its data.
es: ATENCIÓN: El archivo /var/lib/mysql/debian-*.flag existe. Esto indica que ya se instaló una versión superior del paquete mysql-server. No se puede garantizar que esta versión pueda usar sus datos.

source: Important note for NIS/YP users!
es: ¡Nota importante para los usuarios de NIS/YP!

source: To use mysql you must install an equivalent user and group to the following and ensure yourself that /var/lib/mysql has the right permissions (the uid/gid may be different).
es: Para utilizar mysql debe instalar un usuario y grupo equivalente al siguiente y asegurarse de que /var/lib/mysql tiene los permisos correctos (los valores del «uid» y del «gid» pueden ser diferentes).

source: Remove the databases used by all MySQL versions?
es: ¿Eliminar las bases de datos utilizadas por todas las versiones de MySQL?

source: The script is about to remove the data directory /var/lib/mysql. If it is planned to just install a higher MySQL version or if a different mysql-server package is already using it, the data should be kept.
es: Este guión va a eliminar el directorio de datos «/var/lib/mysql». Debería mantener los datos si tiene planificado instalar una versión de MySQL superior o ya hay un paquete «mysql-server» que los está utilizando.

source: Should MySQL start on boot?
es: ¿Debería ejecutarse MySQL al iniciarse el sistema?

source: The MySQL can start automatically on boot time or only if you manually type '/etc/init.d/mysql start'.
es: MySQL puede iniciarse en el momento de arranque del sistema o solamente si se escribe «/etc/init.d/mysql start».

source: New password for MySQL "root" user:
es: Nueva cContraseña para el usuario «root» de MySQL:

source: It is highly recommended that you set a password for the MySQL administrative "root" user.
es: Se recomienda que configure una contraseña para el usuario «root» (administrador) de MySQL.

source: If you do not provide a password no changes will be made to the account.
es: No se hará ningún cambio en la cuenta si no introduce una contraseña.

source: Unable to set password for MySQL "root" user
es: No se pudo fijar la contraseña para el usuario «root» de MySQL

source: It seems an error occurred while setting the password for the MySQL administrative user. This may have happened because the user already has a password, or because there was a problem communicating with the MySQL server.
es: Parece que se produjo un error mientras intentaba fijar la contraseña para el usuario administrador de MySQL. Esto puede haber sucedido porque el usuario ya tenía una contraseña o porque se produjo un error de comunicación con el servidor MySQL.

source: When installation finishes, you should verify that the account is properly protected with a password (see README.Debian for more information).
es: Debería confirmar que la contraseña está correctamente protegida con una contraseña cuando termine la instalación (consulte el fichero README.Debian si desea más información).

source: Support MySQL connections from hosts running Debian "sarge" or older?
es: ¿Soportar las conexiones MySQL establecidadas desde sistemas que ejecutan Debian Sarge o versiones anteriores?

source: The way passwords were stored was not very secure. This has been improved with the drawback that clients (e.g. PHP) from hosts running Debian 3.1 Sarge will not be able to connect to account which are new or whose password have been changed. See /usr/share/doc/mysql-server-5.0/README.Debian.
es: No era muy segura la forma en la que se almacenaban las contraseñas antes. Este problema se ha mejorado con el inconveniente, sin embargo, de que clientes (por ejemplo, PHP) que ejecutan Debian 3.1 «Sarge» no podrán conectarse a cuentas que son nuevas o a las que se le haya cambiado la contraseña. Para más información consulte «/usr/share/doc/mysql-server-5.0/README.Debian».
